const getPeople = obj => {
    
}

const customers = {
    'customer-id-1': {
        name: 'William',
        age: 54
    },
    'customer-id-2': {
        name: 'Tom',
        age: 17
    },
};

/*Нужно написать функцию, которая такой объект преобразует в массив имен жителей

Основные требования:
Функция с именем getPeople должна принимать объект в заданом выше формате
Функция должна вернуть список имен пользователей в виде массива (плоский массив строк ['room1 name1', 'room1 name2', ... 'room2 name1', 'room3 name1', ...]).
Количество комнат и количество людей в комнате может быть любым.
Пользуйтесь разнообразием методов массивов и объектов. Обычный цикл for для решения этой задачи подходит не лучшим образом. */