// function getPrimes(num) {
//     if (num < 0) return;
//     for (let i = 1; i <= num; i++) {
//         for (let j = 1; j < i; j++) {
//             if (i % j === 0) continue;
//         }

//     }
// }
// console.log( 25 / 2);

/*Создайте ф-цию, которая ищет все простые числа от 1 до n. Число является простым, если оно делиться без остатка только на 1 и само на себя

Основные требования:
Имя ф-ции должно быть getPrimes
Функция должна принимать целое положительное число
Функция должна выводить в консоль все простые числа от 1 до заданного числа */